package com.javaex.practice;

public class Ex05 {

	public static void main(String[]args) {
		/*
		자바소스파일(~. java)을 작성할 때 틀린것을 찾아 수정해보세요
		
	    (1)	패키지명은 일반적으로 가독성을 위해 대문자, 소문자 섞어 사용한다.
	    (2)	클래스명은 소문자로만 구성하여 작성한다
		(3)	자바소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야된다. 
	    (4)	실행문 뒤(문자의 끝)에는 반드시 ( : )콜론을 사용해야 한다. 
		(5)	처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다 
				
		해설----------------------------- 
		(1)	패키지명은 일반적으로 가독성을 위해 대문자, 소문자 섞어서 사용하지 않고 
		대문자를 제일 앞에, 소문자는 그 뒤에 사용한다
		ex) Practice01 P만 대문자, 나머지는 소문자 사용(대문자만 맨 앞에 사용)
		
		(2)	클래스명은 소문자로만 구성하여 작성한다
		클래스명은 맨 첫글자는 '대문자'로 작성한다 소문자로 작성시 빨간색 글자로 오류가 날 수 있다
		Ex05.java 처럼 말이다
		
		(4)	실행문 뒤(문자의 끝)에는 반드시 ( : )콜론을 사용해야 한다.
		세미콜론 사용(;)
		
		(5)	처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다
		
		임의가 아닌 main 을 작성
		자바 프로그램의 시작 지점으로 main 함수를 찾음
		------------------------------------------
		(3)	자바소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야된다. 
		클래스명의 첫글자는 대문자로 작성
		소스코드 파일의 이름과 클래스이름은 동일
		*/
	}
}