package com.javaex.practice;

public class Ex06 {

	public static void main(String[]args) {
		/*
			아래의 설명중 맞는 것을 찾아 보세요.  	 2,5,8,9
      O (2)	변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
      O (5)	double형은 flaot보다 큰 수를 담을 수 있다.
	  O (8)	long형은 항상 L을 붙여서 대입해야한다.
	  O (9)	float형은 항상 F을 붙여서 대입해야한다.			
			
			아래의 설명중 틀린 것을 찾아서 수정해 보세요.
			
		(1)	변수한개에는 동시에 여러 개의 값을 담을 수 있다. //담을 수 없다		
		(3)	변수는 초기값이 저장되지 않아도 읽을 수 있다. 
		해설: 변수(Varialble)는 값을 저장하고, 조회하고, 변경 할 수 있어야 함
		
		(4)	모든 자료형의 변수는 동일한 방식으로 저장된다. 
		저장되지 않음
		
		해설: 변수의 자료형에 따라 할당되는 메모리의 크기와 저장할 수 있는 데이터의 범위가 다름.
		자료형에 따른 메모리 할당과 데이터 범위
		1) 정수형의 int는 4byte의 메모리를 할당받아 -2,147,483,648~2,147,483,647의 데이터를 표현할 수 있다
		2) 정수형의 long은 8byte의 메모리를 할당받아 -9223372036854775808~9223372036854775807 의 
		데이터를 표현할 수 있음 
		3) 정수형 중에서 byte는 1byte의 메모리를 할당받아 -128 ~ 127 의 데이터를 표현할 수 있음 
		
		
		(6)	int, float, char, String은 모두 기본자료형에 속한다
		
		해설 : 기본자료형에는 크게 보면 논리형,문자형,정수형,실수형이 있다
		문자형은 char, 정수형은 byte,short,int,long, 실수형은 float,double 형이 있다
		
		(7)	final로 선언된 변수는 수정이 가능하다
		상수(constant)는 저장할 수 있으며 변경할 수 없다.(확인은 가능)
	 
		 */
	}
}
